{
    "title": "Zoom General Settings",
    "__version": "1.0",
    "__preferencedomain": "us.zoom.config",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://support.zoom.us/hc/en-us/articles/115001799006"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
		"DisableDaemonInstall": {
            "title": "Controls the use of the daemon helper to install updates, which bypasses the need to enter admin credentials when upgrading. This option requires AutoUpdate option to be enabled, and will fail if not enabled.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
		"DisableZoomOnboarding": {
            "title": "Disables the onboarding experience displayed the first time the Zoom desktop app is installed. False = Allow onboarding experience. True =  Disable onboarding experience.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoSSOLogin": {
            "title": "Default to Login with SSO",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zSSOHost": {
            "title": "Preconfigured SSO URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "company.zoom.us"
                        }
                    }
                }
            ]
        },
        "ForceSSOURL": {
            "title": "Lock SSO URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableAutoLaunchSSO": {
            "title": "Do not launch previously used SSO URL",
            "description": "(DisableAutoLaunchSSO)-Prevent Zoom from automatically launching the previously used SSO URL. This is useful for users with multiple accounts, each having their own SSO URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableDiscoverWhatsNew": {
            "title": "Disables the What's New window, which highlights new features and enhancements for the desktop app version currently installed.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableCaptureObjByPicker": {
            "title": "Allows the MacOS System Picker to capture screen and audio content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableMultipleAccountsSwitch": {
            "title": "Disable the ability for users to be signed-in to multiple accounts and easily switch between them. If disabled, users must manually sign out and then sign in to another account.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableCloudSwitch": {
            "title": "Enable the option to switch between Zoom commercial (default) and Zoom for Gov.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NoGoogle": {
            "title": "Disable Sign in with Google",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NoFacebook": {
            "title": "Disable Sign in with Facebook",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableLoginWithMicrosoft": {
            "title": "Disable login with Microsoft.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableAppleLogin": {
            "title": "Allow access to Apple login option.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableLoginWithEmail": {
            "title": "Disable Sign in with Email Address",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NoSSO": {
            "title": "Disable SSO Login",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableKeepSignedInWithSSO": {
            "title": "Require SSO Sign in on Application Launch",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableKeepSignedInWithGoogle": {
            "title": "Require Google Sign in on Application Launch",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableKeepSignedInWithFacebook": {
            "title": "Require Facebook Sign in on Application Launch",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableEmbedBrowserForSSO": {
            "title": "Launch SSO Login in App",
            "description": "(enableembedbrowserforsso)-Launches the SSO Sign in in App rather than the user's default browser",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnforceSignInToJoin": {
            "title": "Force Sign-in to Join Meeting",
            "description": "(EnforceSignInToJoin)-Forces users to be signed in before joining a meeting from the app. Users can be signed-in on the web portal when joining through join URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnforceAppSignInToJoin": {
            "title": "Force App Sign-in to Join Meeting",
            "description": "(EnforceAppSignInToJoin)-Require the client to be logged-in to a Zoom account before joining any meeting or webinar",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SetWebDomain": {
            "title": "Sign in Web Domain",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "https://zoom.us"
                        }
                    }
                }
            ]
        },
        "KeepSignedIn": {
            "title": "Automatically Login to Last Account Used (email only)",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disableDaemonInstall": {
            "title": "Disable Auto Update Daemon",
            "description": "(disableDaemonInstall)-Controls the use of the daemon helper to install updates, which bypasses the need to enter admin credentials when upgrading. This option requires AutoUpdate option to be enabled, and will fail if not enabled",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "Login_Domain": {
            "title": "Login Domain for Email Addresses",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "company.com"
                        }
                    }
                }
            ]
        },
        "DefaultUsePortraitView": {
            "title": "Default to Portrait Mode",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableDirectShare": {
            "title": "Disable Direct Share",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PresentToRoomWithAudio": {
            "title": "Allow Audio when Presenting to a Zoom Room",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableHIDControl": {
            "title": "Enable HID Control of USB Audio Devices",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableStartMeetingWithRoomSystem": {
            "title": "Display Call Room System Button on Zoom Home Screen",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PresentToRoomOptimizeVideo": {
            "title": "Optimize Screen Sharing for Zoom Room Sharing",
            "description": "(PresentToRoomOptimizeVideo)-Client will optimize screen sharing for video clip when sharing directly to a Zoom Room",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PresentToRoomOption": {
            "title": "Set Sharing Option when Sharing Directly to Zoom Room",
            "description": "(PresentToRoomOption)-False shows all sharing options, True automatically shares the entire desktop",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PresentInMeetingOption": {
            "title": "Set Sharing Option when Sharing Directory to Zoom Room Within a Meeting",
            "description": "(PresentInMeetingOption)-False shows all sharing options, True automatically shares the entire desktop",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "Account": {
            "title": "Restricted Account ID",
            "description": "(Account)-Account ID that the client is restricted to join meetings hosted by specific accounts",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://support.zoom.us/hc/en-us/articles/115001799006#note"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "1234567"
                        }
                    }
                }
            ]
        },
        "SetDevicePolicyToken": {
            "title": "Internal Meeting Authentication Token",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://support.zoom.us/hc/en-us/articles/115001799006#note"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "Token"
                        }
                    }
                }
            ]
        },
        "AlwaysShowVideoPreviewDialog": {
            "title": "Show Video Previews when Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LegacyCaptureMode": {
            "title": "Disable GPU Acceleration",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BlockUntrustedSSLCert": {
            "title": "Block Untrusted SSL Connections",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EmbedUserAgentString": {
            "title": "Embedded User Agent String",
            "description": "(embeduseragentstring)-Allows embedding text in the Zoom using a user agent string",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "User Agent String"
                        }
                    }
                }
            ]
        },
        "IgnoreBandwidthLimits": {
            "title": "Ignore Bandwidth Limits",
            "description": "(IgnoreBandwidthLimits)-Ignore bandwidth limited set on web settings. Useful for exceptions",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableZoomApps": {
            "title": "Disable Zoom App Quick Launch",
            "description": "(DisableZoomApps)-Hide Zoom Apps quick launch button in the Zoom interface",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableChat": {
            "title": "Disable Group Chat",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableLinkPreviewInChat": {
            "title": "Disable Link Preview in Chat",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PlaySoundForIMMessage": {
          "title": "Play Sound for IM Messsages",
          "anyOf": [
            {"type": "null", "title": "Not Configured"},
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "ShowIMMessagePreview": {
          "title": "Show IM Message Preview",
          "anyOf": [
            {"type": "null", "title": "Not Configured"},
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "MuteIMNotificationWhenInMeeting": {
          "title": "Mute IM Notifications when In Meeting",
          "anyOf": [
            {"type": "null", "title": "Not Configured"},
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "ShowVoiceMessageButton": {
            "title": "Disable Sending Voice Messages",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "UsePMI": {
            "title": "Always use PMI for Instant Meetings",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZDisableVideo": {
            "title": "Disable Camera by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableSendVideo": {
            "title": "Disable Sending Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableRecvVideo": {
            "title": "Disable Receiving Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableComputerAudio": {
            "title": "Disable Computer Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MuteWhenLockScreen": {
            "title": "Mute when Screen is Locked",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableOriginalSound": {
            "title": "Enable Original Sound for Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoJoinVoip": {
            "title": "Automatically Join VoIP",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AudioAutoAdjust": {
            "title": "Automatically Adjust Microphone Levels",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableEchoCancellation": {
            "title": "Enable Echo Cancellation for Microphone Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SetUseSystemDefaultSpeakerForVOIP": {
            "title": "Use System Default Speaker when Using Computer Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SetUseSystemDefaultMicForVOIP": {
            "title": "Use System Default Speaker when Using Microphone Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZDualMonitorOn": {
            "title": "Automatically Enable Dual Monitor",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoFullScreenWhenViewShare": {
            "title": "Automatically Enter Full Screen when Sharing Content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoFitWhenViewShare": {
            "title": "Auto Fit to Window when Sharing Content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableAnnotation": {
            "title": "Disable Annotation When Screen Sharing or Viewing a Screen Share",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableDoNotDisturbInSharing": {
            "title": "Enable Do Not Disturb when Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableWhiteboard": {
            "title": "Disable White Board",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableShareVideo": {
            "title": "Allow Sharing of Video Clips",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/202954249"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "EnableShareAudio": {
            "title": "Allow Sharing of Audio Only when Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "FullScreenWhenJoin": {
            "title": "Default to Full Screen when Starting or Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoHideToolbar": {
            "title": "Always Show Meeting Controls",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZUse720PByDefault": {
            "title": "Enable HD Video by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZRemoteControllAllApp": {
            "title": "Remote Control all Applications",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZHideNoVideoUser": {
            "title": "Hide non Video Participants by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MuteVoipWhenJoin": {
            "title": "Always Mute Microphone when Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowConnectedTime": {
            "title": "Show Time Connected in Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ConfirmWhenLeave": {
            "title": "Confirm Before Leaving Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableScreenShare": {
            "title": "Disable Screen Sharing when Starting or Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableFT": {
            "title": "Disable In-Meeting File Transfers",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableMeeting3rdPartyFileStorage": {
            "title": "Disable In-Meeting Third Party File Transfers",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableRemoteControl": {
            "title": "Disable Remote Control When Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/201362673"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableRemoteSupport": {
            "title": "Disable 1-1 Remote Support when Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/208072316"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableClosedCaptioning": {
            "title": "Disable Closed Captioning",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/4403492514829"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableQnA": {
            "title": "Disable Q&A",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/203686015"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableSlideControl": {
            "title": "Disable Slide Control",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/4411656450701"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "EnableMirrorEffect": {
            "title": "Enable Mirroring of Shared Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableSplitScreen": {
            "title": "Enable Side by Side Mode by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zDisableLocalRecord": {
            "title": "Disable Local Recording",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/201362473"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "zDisableCMR": {
            "title": "Disable Cloud Recording",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/203741855"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableVirtualBkgnd": {
            "title": "Disable Virtual Backgrounds",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/210707503"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DisableVideoFilters": {
            "title": "Disable Video Filters",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://support.zoom.us/hc/en-us/articles/115002595343#h_01EEEKW5C9492RGWQ6KN55WQJ7"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "SetScreenCaptureMode": {
            "title": "Screen Capture Mode",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Auto",
                            "Legacy OS",
                            "Share with Window Filtering",
                            "Advanced Share with Window Filtering",
                            "Advanced Share without Window Filtering"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3,
                        4
                    ]
                }
            ]
        },
        "EnableIndependentDataPort": {
            "title": "Split Traffic Across Different Ports",
            "description": "(EnableIndependentDataPort)-If enabled, Video will use port 8801, Screensharing 8802, and Audio 8803",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableSSLVerification": {
            "title": "Enable SSL Verification",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableRemindMeetingTime": {
            "title": "Enable Upcoming Meeting Reminders",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "Enable49Video": {
            "title": "Enable Gallery View",
            "description": "(Enable49Video)-Enables up to 49 Participants per screen",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableSpotlightSelf": {
            "title": "Enable Spotlight for Video when Participant Speaks",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BandwidthLimitUp": {
            "title": "Limit Maximum Upstream Bandwidth",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "5000"
                        }
                    }
                }
            ]
        },
        "BandwidthLimitDown": {
            "title": "Limit Maximum Downstream Bandwidth",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "5000"
                        }
                    }
                }
            ]
        },
        "RecordPath": {
            "title": "Local Path to Meeting Recordings",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/Users/Shared/"
                        }
                    }
                }
            ]
        },
        "ProxyBypass": {
            "title": "Set Proxy Bypass Rule",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "ProxyServer": {
            "title": "Proxy Server",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "ProxyPAC": {
            "title": "Proxy Server PAC URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "SetSuppressBackgroundNoiseLevel": {
            "title": "Set Noise Suppression Level",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Auto",
                            "Low",
                            "Medium",
                            "High"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ]
        },
        "EnableDiagnostic": {
            "title": "Controls the ability for the desktop app to access the Network Connectivity Tool, which allows a user to test their network connection with Zoom services.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
